/* Dialog Strings */
"SAVE" = "Save";
"DONTSAVE" = "Don’t Save";
"CANCEL" = "Cancel";
"DELETE" = "Delete";
"OK" = "OK";
"APPLY" = "Apply";
"REVERT" = "Revert";
"DONTAPPLY" = "Don’t Apply";
"CONTINUE" = "Continue";
"NONE" = "None";
"ASSIST" = "Assist me…";
"NEW_ISP" = "Get New ISP…";
"CREATE" = "Create";
"DO_NOT_CREATE" = "Don't Create";
"UNKNOWN" = "Unknown";
"DONE" = "Done";
"AUTHENTICATE" = "Authenticate";
"DEAUTHENTICATE" = "Deauthenticate";

"ADVANCED" = "Advanced";
"SETUP" = "Set Up…";
"CONNECT" = "Connect";
"DISCONNECT" = "Disconnect";
"DIAL_NOW" = "Dial Now";

"EDIT_BUTTON_RENAME" = "Rename";
"EDIT_BUTTON_EDIT" = "Edit…";

"LINK_AGGREGATE" = "Link Aggregate";

/* Panel Strings */
"SAVE_CONFIG" = "Apply configuration changes?";
"IP_FROM_SERVER" = "IP Address: Will be provided by server\n";
"IP_ADDR" = "IP Address: %@\n";
"DELETE_LOC" = "Do you really want to delete the location “%@”?";
"DELETE_CFG" = "Do you really want to delete the configuration “%@”?";
"DELETE_SERVICE" = "Do you really want to delete the service titled “%@”?";
"NO_UNDO_DESC" = "This cannot be undone.";
"DELETE_SERVICE_MULTIPLE_SETS_TITLE" = "The service “%@” is in multiple locations";
"DELETE_SERVICE_MULTIPLE_SETS_MESSAGE" = "Do you want to delete it from all locations or just the current location?";
"DELETE_SERVICE_MULTIPLE_SETS_DEFAULT_BUTTON" = "Delete from All";
"DELETE_SERVICE_MULTIPLE_SETS_ALTERNATE_BUTTON" = "Delete from Current";
"RENAME_CFG" = "Change the configuration name:";
"RENAME_SERVICE" = "Enter a new name for “%@”.";
"CREATE_CFG" = "Create a new configuration called:";
"CREATE_SERVICE" = "Create a new service called:";
"DUPLICATE_SERVICE" = "Enter a name for the duplicate of “%@”.";
"AUTOMATIC_CFG" = "Automatic";
"DEFAULT_CFG" = "Default";
"UNTITLED_CFG" = "Untitled";
"CFG_NAME" = "Configuration name:";
"CFG_COPY_NO_FORMAT" = "Copy";
"CFG_COPY" = "%@ Copy";
"AIRPORT_ID" = "AirPort ID:";
"ENET_ID" = "Ethernet Address:";
"DEFAULT_PPPoE_SERVICE_NAME" = "PPPoE";
"INVALID_NAME" = "Invalid name!";
"DUPLICATE_NAME" = "Name must be unique!";
"INVALID_VLAN_TAG" = "Tag is out of range!";
"DUPLICATE_VLAN_TAG" = "Tag must be unique!";
"TURN_AIRPORT_OFF" = "Turn AirPort Off";
"TURN_AIRPORT_ON" = "Turn AirPort On";
"AIRPORT_POWER_ON" = "On";
"AIRPORT_POWER_OFF" = "Off";
"VPN_TITLE" = "VPN (%@)";
"L2TP_TITLE" = "L2TP";
"PPTP_TITLE" = "PPTP";
"CISCO_IPSEC_TITLE" = "Cisco IPSec";
"IPSEC_TITLE" = "IPSec";

"6 to 4" = "6 to 4";

"MODEM_GENERIC" = "Generic";
"MODEM_OTHER" = "Other";

"UNTITLED_INTERFACE" = "Untitled";
"UNTITLED_SERVER" = "Untitled Server";

"ALERT_UNSAVED_CHANGES_FORMAT" = "The “%@” service has changes that have not been applied. Would you like to apply them?";
"ALERT_UNSAVED_CHANGES" = "This service has unsaved changes";
"ALERT_UNSAVED_CHANGES_EXIT" = "Would you like to apply your changes before closing the Network preferences pane?";
"ALERT_UNSAVED_CHANGES_IMPORT" = "Importing will cause any unsaved changes to be lost. Would you like to apply your changes before importing the configuration?";
"ALERT_UNSAVED_CHANGES_SWITCH" = "Would you like to apply your changes before switching services?";
"ALERT_UNSAVED_CHANGES_LOCATION_SWITCH" = "Would you like to apply your changes before switching locations?";
"ALERT_UNSAVED_CHANGES_LOCATION_EDIT" = "Would you like to apply your changes before editing locations?";
"ALERT_UNSAVED_CHANGES_TOGGLE_AIRPORT_POWER" = "Switching AirPort power will cause any unsaved changes to be lost. Would you like to apply your changes before switching AirPort's power?";
"ALERT_UNSAVED_CHANGES_TOGGLE_DHCP_LEASE" = "Renewing the DHCP lease will cause any unsaved changes to be lost. Would you like to apply your changes before renewing the DHCP lease?";
"ALERT_UNSAVED_CHANGES_CONNECTING" = "Connecting without applying your changes will use the previous settings. Would you like to apply your changes before connecting?";

"DELETE_VLAN_MULTIPLE" = "This VLAN is in use by %d network services.";
"DELETE_VLAN_ONE" = "This VLAN is in use by a network service.";
"DELETE_VLAN" = "Do you really want to delete the VLAN “%@”?";
"DELETE_VLAN_INFO" = "All network services using this VLAN will be deleted if you delete the VLAN. Deleting services or VLANs cannot be undone. Do you want to continue deleting the VLAN and its associated configurations?";

"DELETE_BOND_MULTIPLE" = "This aggregate is in use by %d network services.";
"DELETE_BOND_ONE" = "This aggregate is in use by a network service.";
"DELETE_BOND" = "Do you really want to delete the aggregate “%@”?";
"DELETE_BOND_INFO" = "All network services using this aggregate will be deleted if you delete the aggregate. Deleting services or aggregates cannot be undone. Do you want to continue deleting the aggregate and its associated configurations?";
"UNTITLED_VLAN" = "Untitled VLAN";
"UNTITLED_BOND" = "Untitled Bond";

"BOND_MEMBER_STATUS_ALL_CONNECTED" = "All of the member interfaces are connected.";
"BOND_MEMBER_STATUS_SOME_CONNECTED" = "Some of the member interfaces are connected. Click Advanced for details.";
"BOND_MEMBER_STATUS_NONE_CONNECTED" = "None of the member interfaces are connected. Click Advanced for details.";

"NEW_INTERFACE" = "New Interface Detected";
"SAVE_INTERFACE" =  "A new network interface has been detected:\r\r%@\r\rPlease verify that it is configured correctly, then press Apply to activate it.";

"NEW_INTERFACES" = "New Interfaces Detected";
"SAVE_INTERFACES" =  "New network interfaces have been detected:\r\r%@\r\rPlease verify that they are configured correctly, then press Apply to activate them.";

/*
"NEW_PORT" = "New Port Detected";
"SAVE_PORT" =  "A new network port has been detected:\r\r\t%@\r\rPlease verify that it is configured correctly, then press Apply Now to activate it.";

"NEW_PORTS" = "New Ports Detected";
"SAVE_PORTS" = "New network ports have been detected:\r\r\t%@\r\rPlease verify that they are configured correctly, then press Apply Now to activate them.";
*/

/* "Make Service Active" = "Make “%@” Active"; */
/* "Make Service Inactive" = "Make “%@” Inactive"; */
"Make Service Active" = "Make Service Active";
"Make Service Inactive" = "Make Service Inactive";

"Remove Service" = "Remove Service “%@”…";
"Duplicate Service" = "Duplicate Service “%@”…";
"Rename Service" = "Rename Service “%@”…";
"DELETE_WITH_NAME" = "Delete “%@”…";
"EDIT_WITH_NAME" = "Edit “%@”…";

/* Location Menu */
"EDIT_LOCATIONS" = "Edit Locations…";

/* transmitting and receiving */
"tx" = "tx";
"rx" = "rx";

/* miscellaneous terms returned from configd or systemconfig */
"full" = "full";
"half" = "half";
"full-duplex" = "full-duplex";
"half-duplex" = "half-duplex";
"flow" = "flow";
"flow-control" = "flow-control";
"auto" = "auto";
"autoselect" = "autoselect";

/* misc service title */
"UNKNOWN_SERVICE" = "Unknown Service";

/* status strings */
"Inactive" = "Inactive";
"Connected" = "Connected";
"Connecting" = "Connecting…";
"Disconnecting" = "Disconnecting…";
"Some Connected" = "Some Connected";
"Not Connected" = "Not Connected";
"Not Configured" = "Not Configured";
"Unknown State" = "Unknown State";
"Cable Unplugged" = "Cable Unplugged";

"Self-Assigned IP" = "Self-Assigned IP";
"No IP Address" = "No IP Address";
"Loopback IP" = "Loopback IP";


/* tab labels */
"airport" = "AirPort";
"pppaccounts" = "Accounts";
"ppp" = "PPP";
"tcpip" = "TCP/IP";
"ipv4" = "IPv4";
"ipv6" = "IPv6";
"dns" = "DNS";
"eap" = "802.1X";
"ethernet" = "Ethernet";
"modem" = "Modem";
"pppoe" = "PPPoE";
"proxies" = "Proxies";
"appletalk" = "AppleTalk";
"bonds" = "Bond Status";
"wins" = "WINS";
"wwan" = "WWAN";
"vpnondemand" = "VPN on Demand";
"vpnoptions" = "Options";

"8021X" = "802.1X";

/* service list column titles */
"Services" = "Services";
"Active Services" = "Active Services";
"Inactive Services" = "Inactive Services";
"All Services" = "All Services";
"All Broadband Services" = "All Broadband Services";
"All VPN Services" = "All VPN Services";
"All Wireless Services" = "All Wireless Services";
"All Dial-up Services" = "All Dial-up Services";

"All Active Services" = "All Active Services";
"Active Broadband Services" = "Active Broadband Services";
"Active VPN Services" = "Active VPN Services";
"Active Wireless Services" = "Active Wireless Services";
"Active Dial-up Services" = "Active Dial-up Services";

/* action popup tooltip */
"ACTION_MENU_TOOLTIP" = "Set service order and other actions";

/* Ethernet ID tooltip */
"EthernetID Tooltip" = "The Media Access Control (MAC) identifier for this network hardware";
"AirPortID Tooltip" = "The Media Access Control (MAC) identifier for this network hardware (same as the AirPort ID)";

/* IP Address Validation strings */
"InvalidIPAddress" = "Invalid IP Address";
"InvalidSubnetMask" = "Invalid Subnet Mask";
"InvalidRouterAddress" = "Invalid Router Address";
"InvalidServerAddress" = "Invalid Server Address";
"InvalidDomainLabel" = "Invalid Domain Label";
"LinkLocalAddress" = "Link Local Address";
"InvalidPrefixLength" = "Invalid Prefix Length";

// =-=-= IP Address Error reason strings =-=-=
"BasicValidationError"	= "The IP address must consist of 4 numbers from 0 to 255, separated by periods.";
"BasicSubnetMaskError"	= "The subnet mask must consist of 4 numbers from 0 to 255, separated by periods.";
"DefaultRouteError"	= "The value entered is reserved for the default route and cannot be used as the IP address for this computer.";
"LimitedBroadcastError"	= "The value entered is the limited broadcast address and cannot be used as the IP address for this computer.";
"FirstQuadReservedError"	= "The first quad of the value entered is out of range and cannot be used as the router address for this computer.";
"SourceAddressError"	= "The first quad of the value entered cannot be zero.";
"LoopbackError"	= "The first quad of the value entered cannot be 127.";
"BroadcastAddressError"	= "The host address cannot match the broadcast address.";
"NetworkAddressError"	= "The host address cannot be 0.";

// IP Address Octet value error reasons
"OctetMatchError"	= "The network address portion of the IP address doesn't match the subnet address.";
"OctetRangeError"	= "The IP address is not in the range of addresses supported by the router address and subnet mask.";

// IP and Router match error
"IPRouterMatchError"= "The IP address cannot be the same as the router address.";

// IP Address Link Local Address
"LinkLocalError" = "The IP address is not routable. It is recommended that a different IP address be entered.";

// subnet maskk error reasons
"NonContiguousOnesError" = "The subnet mask is not valid. Check the value to make sure it was entered correctly. Contact your network administrator for assistance.";

// DNS Search Domain errors
"SearchDomainLabelError" = "The search domain names must consist of only letters, digits, and hyphens. They must also begin and end with either a letter or a digit.";

// IPv6 address errors
"IPv6BasicValidationError" = "The IPv6 address must consist of 8 hexadecimal numbers from 0x0 to 0xffff, separated by colons.";
"IPv6RouterBasicValidationError" = "The IPv6 router address must consist of 8 hexadecimal numbers from 0x0 to 0xffff, separated by colons.";
// see RFC 3627 for reason less than 127 is recommended
"IPv6PrefixLengthError" = "The IPv6 prefix length must be an integer between 0 and 128. It is recommended that that the value entered be less than 127.";

/* DHCP ID length error strings */
"DHCP_ID_LENGTH_ERROR_TITLE" = "The DHCP Client ID is too long";
"DHCP_ID_LENGTH_ERROR_MESSAGE" = "The DHCP Client ID cannot contain more than 255 characters.";


/* Connect time */
"TIME_HMS" = "%2.2d:%2.2d:%2.2d";
"TIME_1DHMS" = "1 day, %2.2d:%2.2d:%2.2d";
"TIME_DHMS" = "%d days, %2.2d:%2.2d:%2.2d";

/* data quantities for PPP */
"Bytes" = "Bytes";
"KBytes" = "KB";
"MBytes" = "MB";

/* Location Sheet Tooltips */
"DUPLICATE_SET_TOOLTIP" = "Duplicate the selected location";
"DUPLICATE_SERVICE_TOOLTIP" = "Duplicate the selected service";
"DELETE_SET_TOOLTIP" =  "Delete the selected location";
"DELETE_SERVICE_TOOLTIP" =  "Delete the selected service";
"SERVICES_COLUMN_TITLE" = "Services";
"LOCATIONS_COLUMN_TITLE" = "Locations";
"ADD_LOCATION_TOOLTIP" = "Add a location";
"DELETE_LOCATION_TOOLTIP" = "Delete the selected location";

/* Location services sheet title format */
"LOCATION_SERVICES_TITLE" = "Select the services to add to location “%@”";

/* these are for the VPNImporter and any other app that imports configs */
"VPN_SHARED_SECRET" = "IPSec Shared Secret";

/* Keychain */
"IC_KEYCHAIN" = "Internet Connect";
"8021x_KEYCHAIN" = "802.1X Password";
"IC_KEYCHAIN_FORMAT" = "Internet Connect: %@";

/* configuration popup menu item titles */
"Rename item" = "Rename “%@”…";
"Delete item" = "Delete “%@”";

/* addRemove button tooltips */
"ADD_DNS_SERVER_TOOLTIP" = "Add a DNS server address";
"DELETE_DNS_SERVER_TOOLTIP" = "Remove a DNS server address";
"ADD_SEARCH_DOMAIN_TOOLTIP" = "Add a DNS search domain";
"DELETE_SEARCH_DOMAIN_TOOLTIP" = "Remove a DNS search domain";

"ADD_WINS_SERVER_TOOLTIP" = "Add a WINS server address";
"DELETE_WINS_SERVER_TOOLTIP" = "Delete a WINS server address";
"Add WINS server address" = "Add WINS server address";
"Delete WINS server address" = "Delete WINS server address";

"ADD_8021X_CONFIG_TOOLTIP" = "Add an 802.1X configuration";
"DELETE_8021X_CONFIG_TOOLTIP" = "Delete an 802.1X configuration";
"Add an 802.1x configuration" = "Add an 802.1X configuration";
"Delete an 802.1x configuration" = "Delete an 802.1X configuration";

"ADD_IPV6_ADDRESS_TOOLTIP" = "Add a new IPv6 Address";
"DELETE_IPV6_ADDRESS_TOOLTIP" = "Delete the selected IPv6 Address";

"ADD_SERVICE_TOOLTIP" = "Create a new service";
"REMOVE_SERVICE_TOOLTIP" = "Delete the selected service";

"CURRENT_NETBIOS_NAME_FORMAT" = "%@ is currently being used.";

"CUSTOM_RANGE_FORMAT" = "( %d to %d )";
"MTU_RANGE_ERROR_TITLE" = "Value Out of Range";
"MTU_RANGE_ERROR_FORMAT_UNDER_MIN" = "The MTU value entered is less than the minimum value (%d) supported by this interface.";
"MTU_RANGE_ERROR_FORMAT_OVER_MAX" = "The MTU value entered is over the maximum value (%d) supported by this interface.";
"MTU_RANGE_ERROR" = "The value entered is not in the range of MTU values supported by this interface.";

// proxy descriptions
"FTP Proxy" = "FTP Proxy";
"Web Proxy (HTTP)" = "Web Proxy (HTTP)";
"Secure Web Proxy (HTTPS)" = "Secure Web Proxy (HTTPS)";
"Streaming Proxy (RTSP)" = "Streaming Proxy (RTSP)";
"SOCKS Proxy" = "SOCKS Proxy";
"Gopher Proxy" = "Gopher Proxy";
"Automatic Proxy Configuration" = "Automatic Proxy Configuration";
"Auto Proxy Discovery" = "Auto Proxy Discovery";
		
// proxy titles
"FTP Proxy Server" = "FTP Proxy Server";
"Web Proxy Server" = "Web Proxy Server";
"Secure Web Proxy Server" = "Secure Web Proxy Server";
"Streaming Proxy Server" = "Streaming Proxy Server";
"SOCKS Proxy Server" = "SOCKS Proxy Server";
"Gopher Proxy Server" = "Gopher Proxy Server";
"Proxy Configuration File" = "Proxy Configuration File";

/* certificate alert strings */
"NO_CERT_ALERT_TITLE" = "No certificates found";
"NO_CERT_ALERT_INFO" = "Certificate authentication cannot be used because your keychain does not contain any suitable certificates. Use Keychain Access to import the appropriate certificates into your keychain. If you do not have the certificates required for authentication, contact your network administrator.";
"NO_CERT_MACHINE_ALERT_TITLE" = "No machine certificates found";
"NO_CERT_MACHINE_ALERT_INFO" = "Certificate authentication cannot be used because your keychain does not contain any suitable certificates. Use Keychain Access to import the appropriate certificates into your keychain. If you do not have the certificates required for authentication, contact your network administrator.";
"NO_CERT_ALERT_OK" = "OK";
"NO_CERT_SELECTED" = "None selected";
"SELECT_USER_CERT_TITLE" = "Select your user authentication certificate:";
"SELECT_TLS_CERT_TITLE" = "Select your TLS certificate:";
"SELECT_MACHINE_CERT_TITLE" = "Select your machine authentication certificate:";
"SELECT_CERT_INFO" = "None selected";
"CERT_NOT_FOUND" = "Not in keychain";
"CERT_NOT_FOUND_TOOLTIP" = "The selected certificate is no longer in the keychain";

// advanced VPNOnDemand tooltips and AX overrides
"ADD_VPN_DOMAIN" = "Add a new domain to the list";
"REMOVE_VPN_DOMAIN" = "Remove the selected domain from the list";
"Add VPN on Demand domain" = "Add VPN on Demand domain";
"Remove VPN on Demand domain" = "Remove VPN on Demand domain";

/* normally redial timeout is specified in seconds. set this to "YES" to specify redial timeout in minutes. */
/* Japanese Law requires this value to be in minutes, so Japanese translations should set this to "YES". */
/* Others should leave it set to "NO". */
"REDIAL_IN_MINUTES" = "NO";
"MINUTES_LABEL" = "minutes before redialing"; 

/* 802.1x dialog strings */
"ONEX_TLS_TITLE" = "Turning on TLS will cause authentication to fail.";
"ONEX_TLS_INFO" = "TLS can't be enabled because your keychain does not contain any suitable certificates. Use Keychain Access to import the appropriate certificates into your keychain. If you do not have the certificates required for authentication, contact your network administrator.";
"NO_CERTS" = "No Certificates Found";
"TLS_DESC" = "Select your TLS certificate:";

"ONEX_OFF_STATUS" = "802.1X is disabled";
"ONEX_ON_STATUS" = "802.1X is enabled";
"ONEX_INACTIVE_STATUS" = "802.1X is inactive";
"TURN_ONEX_OFF" = "Disable 802.1X";
"TURN_ONEX_ON" = "Enable 802.1X";

"ONEX_LOGIN_OFF_STATUS" = "802.1X login is disabled";
"ONEX_LOGIN_ON_STATUS" = "802.1X login is enabled";
"TURN_LOGIN_ONEX_OFF" = "Disable 802.1X Login";
"TURN_LOGIN_ONEX_ON" = "Enable 802.1X Login";

"ENABLE_8021X_TOOLTIP" = "Click to enable or disable system 802.1X authentication for this network service.";
"ENABLE_8021X_TOOLTIP_NEED_NAME" = "There must be a username and password to allow enabling 802.1X authentication.";
"ONEX_AUTH_BUTTON_TOOLTIP" = "Click to authenticate using an 802.1X configuration";
"ONEX_LOGIN_CREDS_TOOLTIP" = "The user name and password are only used to get the certificate and set the trust on it. They are not preserved.";

/* Authentication information */
"ONEX_AUTH_FAILED" = "802.1X Authentication has failed.";
"ONEX_CLIENT_STATUS_FAILED" = "802.1X is unable to authenticate. It is possible that the configuration you have provided is invalid. If you are unsure about what configuration to connect with, check with your network administrator."; 
"ONEX_PROTOCOL_FAILURE" = "One or more of the protocols you are trying to connect with are not supported. If you are unsure about what protocols to connect with, check with your network administrator."; 
"ONEX_INNER_PROT_FAILURE" = "One or more of the inner protocols you are trying to connect with are not supported. If you are unsure about what inner protocols to connect with, check with your network administrator."; 
"ONEX_SECURITY_ERROR" = "Security Error: %d";
"ONEX_ERROR_PORT" = "( Error: %1$d on port %2$@ )";

"ONEX_AUTHENTICATING" = "Authenticating";
"ONEX_CONNECTED" = "Authenticated";
"ONEX_CONNECTED_VIA" = "Authenticated via %@";
"ONEX_CONNECTED_VIA_PROT" = "Authenticated via %@ (%@)";
"ONEX_ELAPSED_TIME" = "Connect Time: %@";
"ONEX_NO_AUTHENTICATOR" = "Authentication server is not responding";

"ONEX_PROGRESS_TITLE" = "Configuring %@ Settings for %@";
"ONEX_PROGRESS_STEP_AUTH" = "Authenticating…";
"ONEX_PROGRESS_STEP_TRUST" = "Setting Trust…";

"ONEX_SYSTEM_DOMAIN" = "System Profiles";
"ONEX_LOGINWINDOW_DOMAIN" = "Login Window Profiles";
"ONEX_USER_DOMAIN" = "User Profiles";
"ONEX_SYSTEM_CONFIG" = "System Profile";
"ONEX_LOGINWINDOW_CONFIG" = "Login Window";

"ONEX_REPLACE_SYSTEM_CONFIG_TITLE" = "Replace the System Profile?";
"ONEX_REPLACE" = "Replace";
"ONEX_REPLACE_SHEET_INFO" = "Replace the system profile with the profile titled “%@”?";

"ONEX_NETWORK_NAME_IN_CONFIG_ALREADY_TITLE" = "There is already a profile for this network.";
"ONEX_NETWORK_NAME_IN_CONFIG_ALREADY_INFO" = "Creating another profile for this network could impair the ability to auto-join the network.";

/* status strings */
"UNKNOWN_SUMMARY" = "The status of your network connection cannot be determined.";
"UNKNOWN_STATUS" = "Network status is unknown";

/* airport tooltips */
"ADD_NETWORK_TOOLTIP" = "Add a preferred network to the list";
"DELETE_NETWORK_TOOLTIP" = "Remove a network from the preferred list";

/* Status View AirPort Specific */
"AIRPORT_OFF" = "%@ is currently off";
"AIRPORT_ON" = "%@ is currently on";
"AIRPORT_CONNECTED" = "%@ is connected to a network";
"AIRPORT_UNKNOWN" = "The status of your wireless connection is unknown.";
"AIRPORT_NO_NETWORK" = "No network selected";

/* airport status summary strings */
"AIRPORT_NOT_CONNECTED_TO_NETWORK" = "%@ is turned on but is not connected to a network.";
"AIRPORT_CONNECTED_TO" = "%1$@ is connected to %2$@.";
"AIRPORT_CONNECTED_TO_IBSS" = "%1$@ is connected to the Computer-to-Computer network %2$@.";
"AIRPORT_NO_IP" = "%@ does not have an IP address and cannot connect to the Internet.";
"AIRPORT_NO_IP_CONFIGMETHOD" = "%1$@ is set up to receive an IP address by %2$@, but it does not have an IP address and cannot connect to the Internet.";
"AIRPORT_CONNECTED_WITH_IP" = "%1$@ is connected to %2$@ and has the IP address %3$@.";
"AIRPORT_LINK_LOCAL" = "%@ has the self-assigned IP address %@ and will not be able to connect to the Internet.";
"AIRPORT_NO_ROUTER" = "Cannot communicate with the base station. Make sure the base station is set up properly.";
"AIRPORT_NO_REACH_IP" = "%@ is connected to the wireless network, but the status of the base station is unavailable. You may be connected to the Internet.";
"AIRPORT_NO_DNS" = "%@ is connected to the Internet, but the DNS settings may not be set up properly.";
"AIRPORT_INTERNET_SHARING" = "Internet Sharing is on and is using %@ to share the connection.";

/* airport interface join networks switch */
"AIRPORT_JOIN_AUTOMATICALLY_ON" = "Known networks will be joined automatically. If no known networks are available, you will be asked before joining a new network.";
"AIRPORT_JOIN_AUTOMATICALLY_OFF" = "Known networks will be joined automatically. If no known networks are available, you will have to manually select a network.";


/* Status View Ethernet Specific */
"ETHERNET_ACTIVE" = "%@ is currently active";
"ETHERNET_NOT_ACTIVE" = "%@ is not active";
"ETHERNET_CONNECTED" = "%@ is connected";
"ETHERNET_NOT_CONNECTED" = "%@ is not connected";

/* ethernet status summary strings */
"ETHERNET_ACTIVE_INFO" = "%1$@ is currently active and has the IP address %2$@.";
"ETHERNET_PLUGGED_NOT_CONNECTED" = "The cable for %@ is connected, but your computer does not have an IP address.";
"ETHERNET_NOT_PLUGGED" = "Either the cable for %@ is not plugged in or the device at the other end is not responding.";
"ETHERNET_LINK_LOCAL" = "%@ has a self-assigned IP address and will not be able to connect to the Internet.";
"ETHERNET_NO_ROUTER" = "Network Status cannot communicate with the router.";
"ETHERNET_NO_REACH_IP" = "%@ is connected to your local network, but Network Status cannot verify that you are connected to the Internet.";
"ETHERNET_NO_DNS" = "%@ is connected, but DNS is not working as expected and may not be configured properly.";
"ETHERNET_LOOPBACK" = "%@ has a loopback IP address and may not be able to connect.";

/* Bluetooth PAN */
"DEVICE_NOT_CONNECTED_FORMAT" = "%1$@ is not connected.";

/* iPhone USB */
"USB_NOT_PLUGGED" = "Either the cable for %@ is not plugged in or the device is not responding.";

/* FireWire status summary strings */
"FIREWIRE_NOT_CONNECTED" = "No network capable FireWire devices are connected.";

/* Modem Status View */
"MODEM_NOT_CONFIGURED" = "%@ is not configured";
"MODEM_CONNECTED" = "%@ is connected";
"MODEM_NOT_CONNECTED" = "%@ is not connected";

/* Modem Status Summary */
"MODEM_NO_SETTINGS" = "%@ has not been configured.";
"MODEM_READY" = "Press the Connect button to connect to the network.";

/* VPN Simple Status */
"VPN_INACTIVE" = "%@ is inactive";
"VPN_CONNECTED" = "%@ is connected";
"VPN_CONNECTING" = "%@ is connecting…";
"VPN_DISCONNECTING" = "%@ is disconnecting…";
"VPN_NOT_CONNECTED" = "%@ is not connected";
"VPN_UNKNOWN_STATE" = "%@ has an unknown state";
"VPN_NOT_CONFIGURED" = "%@ is not configured";

/* Link aggregation service */
"LINK_ALERT_TITLE" = "Existing configurations will be lost";
"LINK_ALERT_EXISTING_CONFIG" = "Any existing configurations on the selected ports will be lost. Are you sure you want to create an aggregate?";
"LINK_STATUS_SPEED_DOWN" = "down";
"LINK_STATUS_ENABLED" = "OK";
"LINK_STATUS_INVALID" = "Invalid Link";
"LINK_STATUS_NO_PARTNER" = "No Partner";
"LINK_STATUS_NOT_ACTIVE_GROUP" = "Wrong Group";
"LINK_STATUS_UNKNOWN" = "Unknown";
"LINK_STATUS_TOOLTIP_ENABLED" = "No problems detected.";
"LINK_STATUS_TOOLTIP_INVALID" = "The link state was not valid (i.e. down, half-duplex, or wrong speed).";
"LINK_STATUS_TOOLTIP_NO_PARTNER" = "The port on the switch that the device is connected to doesn't seem to have 802.3ad Link Aggregation enabled.";
"LINK_STATUS_TOOLTIP_NOT_ACTIVE_GROUP" = "The port is connected to a partner but the link aggregation group is different from the one that is active.";
"LINK_STATUS_TOOLTIP_UNKNOWN" = "The status of this device could not be determined.";

/* import/export */
"ALERT_IMPORT_FAILED_TITLE" = "The configurations for “%@” could not be imported.";
"ALERT_IMPORT_FAILED_MESSAGE" = "No “%@” services were found.";
"ALERT_IMPORT_FAILED_NO_SERVICES" = "The “%@” configurations could not be imported because a “%@” service has not been set up in Network preferences.";
"IMPORT_FAILED_BAD_FILE" = "The import failed because the file is invalid.";
"IMPORT_MULTIPLE_FORMAT" = "Multiple %@ services were found. Select the service to import the configurations into:";
"IMPORT_MULTIPLE_8021X_FORMAT" = "Multiple services that support %@ were found. Select the service to import the configurations into:";
"EXPORT_FAILED" = "The export failed.";
"EXPORT_FAILED_FILE" = "Unable to write the configurations out to the file.";
"EXPORT_FAILED_CONFIGS" = "Unable to write the configurations out to the file because there are no configurations.";
"EXPORT_FAILED_CHECKBOXES" = "Unable to write the configurations out to the file because no checkboxes were checked.";
"EXPORT_FAILED_FILE_8021x" = "Unable to write the 802.1X profiles out to the file.";
"EXPORT_FAILED_PROFILES" = "Unable to write the 802.1X profiles out to the file because there are no profiles.";
"EXPORT_FAILED_CHECKBOXES_8021x" = "Unable to write the 802.1X profiles out to the file because no checkboxes were checked.";

"EXPORT_UNTITLED_FILE" = "Untitled";


/* assist me sheet */
/* strings for the assist me alert sheet  */
"ASSIST_SHEET_TITLE" = "Do you need assistance setting up a new network connection or solving a network problem?";
"ASSIST_SHEET_INFO" = "If you need assistance setting up a new network configuration, click Assistant. If you need help solving a problem with your network connection, click Diagnostics.";

"ASSIST_SHEET_DEFAULT_BUTTON_TITLE" = "Assistant…";
"ASSIST_SHEET_OTHER_BUTTON_TITLE" = "Diagnostics…";

/* appletalk strings */
"APPLETALK_ALRT" = "AppleTalk is active on another network service.";
"APPLETALK_ALRT_EXPLANATION" = "Would you like to deactivate AppleTalk on “%@”."; 
"APPLETALK_ALRT_DUP_SERVICE" = "AppleTalk can only be active on one network port at a time. If you continue, AppleTalk will be deactivated on %@."; 

/* TCP/IP Advanced Sheet*/
"IPV6_ROUTER_NOT_AVAILABLE" = "Not Available";

/* Show Menu Extra titles */
"SHOW_VPN_MENUEXTRA" = "Show VPN status in menu bar";
"SHOW_MODEM_MENUEXTRA" = "Show modem status in menu bar";
"SHOW_WWAN_MENUEXTRA" = "Show WWAN status in menu bar";
"SHOW_PPPOE_MENUEXTRA" = "Show PPPoE status in menu bar";
"SHOW_IRDA_MENUEXTRA" = "Show IrDA status in menu bar";

/* Accessibility Strings */
"Location Actions" = "Location Actions";
"Add Location" = "Add Location";
"Delete Location" = "Delete Location";

"Add search domain" = "Add search domain";
"Delete search domain" = "Delete search domain";
"Add DNS server" = "Add DNS server";
"Delete DNS server" = "Delete DNS server";

"Add Service"= "Add Service";
"Delete Service" = "Delete Service";
"Service Actions" = "Service Actions";

"Add Profile"= "Add Profile";
"Delete Profile" = "Delete Profile";

"SERVICE_LOGO_FORMAT" = "%@ Logo";
"Service Logo" = "Service Logo";

/* IPSec VPN server requires prompt */
"SERVER_REQUIRES_PROMPT" = "Server will prompt for password";

/* Bluetooth PAN and iPhone support */
"NO_PAIRED_DEVICES_FOUND" = "No PAN Devices Found";